Revit 2025 API
AnalysisResultSchema.SetUnits Method
 Sets names and multipliers of all units for result visualization
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public void SetUnits(
	IList<string> names,
	IList<double> multipliers
)
Public Sub SetUnits (
	names As IList(Of String),
	multipliers As IList(Of Double)
)
public:
void SetUnits(
	IList<String^>^ names,
	IList<double>^ multipliers
)
member SetUnits :
        names : IList<string> *
        multipliers : IList<float> -> unit
Parameters
names IList<String>
 Unit names for all units (e.g., "Lb" and "Kg")
multipliers IList<Double>
 Numerical coefficients mapped to unit names. They adjust measurement values shown in the legend and display (e.g., 1.0 and 0.451 - if actual measurements are in Lb)
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentsInconsistentException |  names is zero-length or contains duplicate or empty names -or- multipliers contains non-positive numbers, or its length is not equal to the length of names
Example
IList<string> unitNames = new List<string>();
unitNames.Add("Feet");
unitNames.Add("Inches");
IList<double> multipliers = new List<double>();
multipliers.Add(1);
multipliers.Add(12);
AnalysisResultSchema resultSchema = new AnalysisResultSchema("Schema Name", "Description");
resultSchema.SetUnits(unitNames, multipliers);
Dim unitNames As IList(Of String) = New List(Of String)()
unitNames.Add("Feet")
unitNames.Add("Inches")
Dim multipliers As IList(Of Double) = New List(Of Double)()
multipliers.Add(1)
multipliers.Add(12)
Dim resultSchema As New AnalysisResultSchema("Schema Name", "Description")
resultSchema.SetUnits(unitNames, multipliers)
No code example is currently available or this language may not be supported.
No code example is currently available or this language may not be supported.
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace